# Entity Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
Entity Constructor
Entity Class See Also
---
The default-constructed Entity is invalid.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Entity()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
Entity()
```

# Remarks
Invalid entities may be used as token values. E.g., setting an invalid subentity is equivalent to deleting the stored one.
# See Also
Entity Class
Entity Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace